temp1/src/Catalogs/ПрограммныеПродукты/ПрограммныеПродукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммныеПродукты</name>
  <owners>Catalog.Заказчики</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЛицензиии</name>
    <type>
      <types>CatalogRef.ВидыЛицензий</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодписки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПодписки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленНовыйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЛицензии</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>Boolean</types>
        <types>ChartOfCharacteristicTypesRef.СвойстваЛицензий</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствЛицензий</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПинКоды</name>
    <attributes>
      <name>ПинКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАктивации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/InformationRegisters/СвойстваВидовЛицензий/СвойстваВидовЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваВидовЛицензий</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СвойстваЛицензий</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЛицензии</name>
    <type>
      <types>CatalogRef.ВидыЛицензий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвойствоЛицензии</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваЛицензий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/Catalogs/ПрограммныеПродукты/Forms/ФормаЭлемента/Module.bsl
//+++ КИТЭК ЧехловНИ 09.04.2024
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(ЗагружаемыйФайл, ВидЛицензии)

	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(ЗагружаемыйФайл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СвойстваВидовЛицензий.СвойствоЛицензии КАК СвойствоЛицензии,
	|	СвойстваВидовЛицензий.СвойствоЛицензии.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.СвойстваВидовЛицензий КАК СвойстваВидовЛицензий
	|ГДЕ
	|	СвойстваВидовЛицензий.ВидЛицензии = &ВидЛицензии";
	
	Запрос.УстановитьПараметр("ВидЛицензии", ВидЛицензии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыборка = РезультатЗапроса.Выгрузить();
	
	Для НомерСтроки = 1 По Документ.КоличествоСтрок() Цикл
		
		Строка = Документ.ПолучитьСтроку(НомерСтроки);
		МассивСлов = СтрРазделить(Строка, ":");
		
		Если МассивСлов.Количество() < 2 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПараметрыОтбораСвойство = Новый Структура;
		ПВХ = ПланыВидовХарактеристик.СвойстваЛицензий.НайтиПоНаименованию(МассивСлов[0]);
		
		Если ПВХ = Неопределено Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		ПараметрыОтбораСвойство.Вставить("Свойство", ПВХ);
		НайденнаяСтрока = Объект.ДанныеЛицензии.НайтиСтроки(ПараметрыОтбораСвойство);	
		
		ПараметрыОтбораТипЗначения = Новый Структура;
		ПараметрыОтбораТипЗначения.Вставить("СвойствоЛицензии", ПВХ);
		
		ЭлементВыборки = ТЗВыборка.НайтиСтроки(ПараметрыОтбораТипЗначения);
						
		Тип = Новый ОписаниеТипов(ЭлементВыборки[0].ТипЗначения);
				
		НайденнаяСтрока[0].Значение = Тип.ПривестиЗначение();
		
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			
			НайденнаяСтрока[0].Значение = МассивСлов[1];	
			
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧ (ВидЛицензии)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СвойстваВидовЛицензий.СвойствоЛицензии КАК СвойствоЛицензии,
	|	СвойстваВидовЛицензий.СвойствоЛицензии.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РегистрСведений.СвойстваВидовЛицензий КАК СвойстваВидовЛицензий
	|ГДЕ
	|	СвойстваВидовЛицензий.ВидЛицензии = &ВидЛицензии";
	
	Запрос.УстановитьПараметр("ВидЛицензии", ВидЛицензии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить ("Отсутствуют свойства данной лицензии!");
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Объект.ДанныеЛицензии.Добавить();
			НоваяСтрока.Свойство = Выборка.СвойствоЛицензии;
			
			Тип = Новый ОписаниеТипов(Выборка.ТипЗначения);
			
			НоваяСтрока.Значение = Тип.ПривестиЗначение();
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		
		ЗагружаемыйФайл = Диалог.ПолноеИмяФайла;
		
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(ЗагружаемыйФайл, Объект.ВидЛицензиии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЛицензиииПриИзменении(Элемент)
	
	Объект.ДанныеЛицензии.Очистить();
	ЗаполнитьТЧ(Объект.ВидЛицензиии);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры
//--- КИТЭК ЧехловНИ 09.04.2024
